1687/1687.3/Output/Outer-Fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    interface
    {
        type            mapped;
        nFaces          52809;
        startFace       1669992;
    }
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          258;
        startFace       1722801;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          258;
        startFace       1723059;
    }
    adiabatic
    {
        type            wall;
        inGroups        1(wall);
        nFaces          23297;
        startFace       1723317;
    }
)

// ************************************************************************* //
