1687/1687.3/Output/Outer-Fluid/system/decomposeParDict
FoamFile {
    version 2.0;
    class dictionary;
    object decomposeParDict;
    format ascii;
}
method scotch;
numberOfSubdomains 2;
