1687/1687.3/Output/Outer-Fluid/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "precice-config.xml";

participant Outer-Fluid;

modules (CHT);

interfaces
{
  Interface1
  {
    mesh              Outer-Fluid-to-Solid;
    patches           (interface);
    
    readData
    (
      Sink-Temperature-Solid
      Heat-Transfer-Coefficient-Solid
    );
    
    writeData
    (
      Sink-Temperature-Outer-Fluid
      Heat-Transfer-Coefficient-Outer-Fluid
    );
  };
};